[M_GoodBadMordecai MissionDefinition]
MissionDescription="Years ago, Mordecai won the grand prize at Moxxi's Underdome. A little while after that, a thief named Carson stole the loot chest and hid it somewhere in [place]The Dust[-place]. Mordecai has informed you that, if you are able to find Carson and figure out where the guns are buried, you can keep them. "
TurnInDescription="Of the three treasure hunters searching for Mordecai's lost chest, you emerged victorious. Good on ya."
MissionSummary="Find Mordecai's lost treasure chest."

[M_GoodBadMordecai:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Years ago, Mordecai won the grand prize at Moxxi's Underdome. A little while after that, a thief named Carson stole the loot chest and hid it somewhere in [place]The Dust[-place]. Mordecai has informed you that, if you are able to find Carson and figure out where the guns are buried, you can keep them. You've found where the guns are buried, but you'll have to fight off a bandit named Mobley and a Hyperion stooge named Gettle to get the loot."

[M_GoodBadMordecai:ObjSet_Prison MissionObjectiveSetDefinition]
MissionDescriptionOverride="Years ago, Mordecai won the grand prize at Moxxi's Underdome. A little while after that, a thief named Carson stole the loot chest and hid it somewhere in [place]The Dust[-place]. Mordecai has informed you that, if you are able to find Carson and figure out where the guns are buried, you can keep them. After finding an ECHO recorder on Carson's dead brother, you discovered a Hyperion engineer named Gettle kidnapped Carson and put him in the [place]Hyperion Friendship Gulag[-place]."

[M_GoodBadMordecai:ObjSetStash MissionObjectiveSetDefinition]
MissionDescriptionOverride="Years ago, Mordecai won the grand prize at Moxxi's Underdome. A little while after that, a thief named Carson stole the loot chest and hid it somewhere in [place]The Dust[-place]. Mordecai has informed you that, if you are able to find Carson and figure out where the guns are buried, you can keep them. Fortunately, you DID find Carson. Unfortunately, he was murdered by his cellmate, Mobley. However, you've found an important piece of info: Mordecai's stash is buried under a grave marked ''unknown'' in the flats."

[M_GoodBadMordecai:Survive_Showdown MissionObjectiveDefinition]
ProgressMessage="Survive Truxican standoff"
